@extends('frontend.master')

@section('content')
<section class="aw-about-us">
    <div class="subpage-header">
      <h1>আমাদের সম্পর্কে</h1>
    </div>
    <div class="container">
      <div class="row about-us-container">
        <div class="col-lg-4 about-us-tab-left">
          <div class="about-us-header">
            <div class="about-us-content active" data-content="aboutustab1">
              <div class="aw-about-us-title">
                <button>পরিচিতি</button>
              </div>
            </div>
            <div class="about-us-content" data-content="aboutustab2">
              <div class="aw-about-us-title">
                <button>দ্বীনদারসঙ্গী ডটকম প্রতিষ্ঠার কারণ</button>
              </div>
            </div>
            <div class="about-us-content" data-content="aboutustab3">
              <div class="aw-about-us-title">
                <button>আমাদের লক্ষ্য ও উদ্দেশ্য</button>
              </div>
            </div>
          </div>
        </div>
        <div class="col-lg-8 about-us-tab-right">
          <div class="about-us-info">
            <div class="about-us-collapse aboutustab1">
              <div class="about-us-body">
                <h3>বিসমিল্লাহির রহমানির রহীম</h3>
                <p>
                  দ্বীনদারসঙ্গী ডটকম দ্বীনদার পাত্রপাত্রী খোঁজার একটি
                  নির্ভরযোগ্য ইসলামিক অনলাইন ম্যাট্রিমনি। যা সম্পূর্ণ ইসলামী
                  শরিয়াহ অনুযায়ী পরিচালিত। ২০২৪ সালের ১৭ই জুলাই সায়েম সাদাত
                  এটি প্রতিষ্ঠা করেন।<br>
                  <br>
                  সমাজে অনৈতিক সম্পর্ক, যেনা,ব্যভিচার, আত্নহত্যা সহ সকল
                  অধঃপতনের বিপরীতে যারা দ্বীনের উপর অবিচল থাকার চেষ্টা করে
                  তাদের জন্য আদর্শ ইসলামী পরিবার গঠনে দ্বীনদার জীবনসঙ্গী
                  খোঁজাকে সহজ করতে আমাদের এই প্রচেষ্টা। বাংলাদেশের নানা
                  অঞ্চলের দ্বীনদার পাত্র/পাত্রীর বায়োডাটা আমাদের প্লাটফর্মে
                  সংরক্ষিত থাকে। যে কেউ আমাদের প্লাটফর্মে থাকা বায়োডাটাসমূহ
                  দেখতে পারে। কেউ চাইলে আমাদের প্লাটফর্মে বিনামূল্যে একাউন্ট
                  তৈরী করতে এবং বায়োডাটা জমা দিতে পারে। তবে বায়োডাটা জমা
                  দেওয়ার ক্ষেত্রে তাকে বেশ কিছু শর্ত পূরণ করতে হবে। অন্যথায়
                  বায়োডাটা এপ্রুভ করা হয় না। আমাদের প্লাটফর্মে নিজস্ব চাহিদা
                  অনুযায়ী যেমনঃ বৈবাহিক অবস্থা, ঠিকানা, শিক্ষা, পেশা, বয়স,
                  ব্যক্তিগত তথ্য, পারিবারিক অবস্থা ইত্যাদি ফিল্টারিং করে
                  উপজেলা/জেলা/বিভাগ ভিত্তিক পাত্র/পাত্রী খুঁজে নিতে পারে।
                  পছন্দকৃত বায়োডাটার অভিবাবকের যোগাযোগের তথ্য সংগ্রহ করে ফোন
                  কল বা ইমেইলের মাধ্যমে যোগাযোগ করতে পারে। পরবর্তীতে
                  উভয়পক্ষের সম্মতিতে সুন্নতি পদ্ধতিতে বিয়ে সম্পন্ন হওয়ার
                  মাধ্যমে তারা তাদের প্রত্যাশিত দ্বীনদার জীবনসঙ্গী খুঁজে পেতে
                  পারে। আমদের কার্যক্রম শুধুমাত্র উভয় পক্ষের মধ্যে সংযোগ
                  স্থাপন করা।<br><br>
                  আমরা আশা করি এর মাধ্যমে কুরআন ও সুন্নাহ ভিত্তিক সমাজ
                  বিনির্মাণ সম্ভব। ইনশা আল্লাহ
                </p>
              </div>
            </div>
            <div class="about-us-collapse aboutustab2" style="display: none">
              <div class="about-us-body">
                <h3>দ্বীনদারসঙ্গী ডটকম প্রতিষ্ঠার কারণ</h3>
                <p>
                  পৃথিবী আবাদ রাখার সঠিক ও সুশৃঙ্খল বৈধ ব্যবস্থা বিবাহ। বিবাহ
                  আনে মনে শান্তি, হৃদয়ে স্থিরতা, চরিত্রে পবিত্রতা, জীবনে পরম
                  সুখ। বংশে আনে আভিজাত্য, অনাবিলতা। নারী-পুরুষকে করে চিরপ্রেমে
                  আবদ্ধ। দান করে এমন সুখময় দাম্পত্য, যাতে থাকে ত্যাগ ও
                  তিতিক্ষা, শ্রদ্ধা, প্রেম, স্নেহ ও উৎসর্গ।<br><br>
                  আল্লাহ তা’আলা বলেন, তিনি তোমাদেরকে এক ব্যক্তি হতে সৃষ্টি
                  করেছেন এবং তাঁর থেকেই তাঁর স্ত্রীকে বানিয়েছেন, যাতে সে তার
                  নিকট প্রশান্তি লাভ করতে পারে। - (সূরা আরাফ (৭) : ১৮৯)<br>
                  অন্যত্র রাসুলুল্লাহ সা. বলেন, যে ব্যক্তি বিয়ে করলো সে তার
                  অর্ধেক দ্বীন পূর্ণ করে ফেললো। বাকি অর্ধেকের জন্য সে আল্লাহকে
                  ভয় করুক। - (বায়হাকী, শু’আবুল ঈমান –৫৪৮৬)<br><br>
                  অথচ বর্তমান সমাজে অনৈতিক সম্পর্ক, ধর্ষণ, ব্যাভিচার, পরকীয়া,
                  আত্নহত্যা ইত্যাদি সহজলভ্য ও মহামারীর ন্যায় ছড়িয়ে গিয়েছে।
                  পরিবার গঠনের সবচেয়ে গুরুত্বপূর্ণ মাধ্যম বিবাহ করা অত্যন্ত
                  কঠিন হয়ে দাড়িয়েছে। ফলশ্রুতিতে নৈতিক সামাজিক অবক্ষয়ে সমাজ আজ
                  ভারাক্রান্ত।<br><br>
                  অপরদিকে, দ্বীনি ভাই/বোনেরা সকল অনৈসলামিক কার্যকলাপ থেকে
                  নিজেকে রক্ষা করে চলেন। স্রোতের বিপরীতে থেকে দ্বীনের উপর
                  অবিচল থাকার চেষ্টা করেন। তারা রাসুলুল্লাহ সা. এর সুন্নাহ
                  মোতাবেক বিয়ে করে হালালভাবে জীবনযাপন করতে চান। কিন্তু বিভিন্ন
                  কারনে এটা সম্ভবপর হয়ে উঠে না। এর মধ্যে একটা বড় কারন
                  প্রত্যাশিত দ্বীনদার জীবনসঙ্গী পাওয়া কঠিন হওয়া। বিবাহ
                  ক্ষেত্রে নানা প্রতিকূল পরিস্থিতির সম্মুখীন হতে হয়।<br><br>
                  আমাদের দেশে প্রচলিত ঘটকদের অনেকে শুধুমাত্র নিজের ফায়দা
                  হাসিলের জন্য উভয় পক্ষের নিকট মিথ্যা আশ্বাস ও মিথ্যা কথা বলে
                  থাকে যার ফলশ্রুতিতে অনেকেই অপূরণীয় ক্ষতির সম্মুখীন হয়। আবার
                  দেশের বিভিন্ন অনলাইন জেনারেল ম্যাট্রিমনিগুলো দ্বীনদার
                  ভাইবোনদের চাহিদা পূরণ করতে পারেন না। এছাড়াও জেনারেল শিক্ষিত
                  দ্বীনি ভাই/বোনেরা যারা হেদায়েতের উপর রয়েছেন কিন্তু পরিবারের
                  সদস্যরা দ্বীন পালনে উদাসীন তাদের জন্য দ্বীনদার পাত্র/পাত্রী
                  খোঁজাটা আরও চ্যালেঞ্জিং।<br><br>
                  যেখানে রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন-.
                  নারীদেরকে সালেহ (দ্বীনদার-নেককার) পুরুষের নিকট বিবাহ দাও, আর
                  পুরুষদেরকে সালেহা (দ্বীনদার-নেককার) নারীর সাথে বিবাহ দাও;
                  ফলশ্রুতিতে তাদের যে সন্তান হবে তারা হবে উওম (নেককার)। -
                  (সুনানে দারিমী, হাদীস ২২২৭)<br><br>
                  আর দ্বীনদার পাত্র/পাত্রীর সাথে বিবাহ না হলে, বিবাহ পরবর্তী
                  সাংসারিক জীবনে ঝগড়া, অশান্তি এবং নানাবিধ প্রতিকূলতার
                  সম্মুখীন হওয়ার ঝুঁকিতে পড়তে হয় । এতে দ্বীনের উপর অবিচল থাকা
                  কঠিন হয়ে যায়।<br><br>
                  এমন পরিস্থিতিতে দ্বীনি ভাইবোনদের কথা মাথায় রেখে, আমাদের
                  দ্বীনি ভাইবোনদের দ্বীন পালনে সহায়তা করার জন্য আমরা বাংলাদেশে
                  একটি ইসলামিক ম্যাট্রিমনি প্লাটফর্ম করার সিদ্ধান্ত গ্রহণ করি।
                  আল্লাহ সুবহানাহু ওয়া তা’আলার রহমতে আমরা প্লাটফর্মটির কাজ
                  সম্পন্ন করতে পেরেছি। আলহামদুলিল্লাহ।<br><br>
                  দ্বীনদারসঙ্গী ডটকম প্লাটফর্মের মাধ্যমে আপনার প্রত্যাশিত দ্বীনদার
                  পাত্র/পাত্রী সন্ধান সহজ হবে বলে আমরা আশা রাখি ইন শা আল্লাহ।
                  জাযাকুমুল্লাহ খাইরন
                </p>
              </div>
            </div>
            <div class="about-us-collapse aboutustab3" style="display: none">
              <div class="about-us-body">
                <h3>আমাদের লক্ষ্য ও উদ্দেশ্য</h3>
                <div class="about-us-timeline">
                  <div class="goalbox">
                    <p>দ্বীনদার-নেককার পাত্র/পাত্রী সন্ধান সহজ করা</p>
                  </div>
                  <div class="goalbox">
                    <p>
                      বিয়ের জন্য উপযুক্ত নারী-পুরুষকে চরিত্র রক্ষার্থে বিয়েতে
                      উৎসাহিত করা
                    </p>
                  </div>
                  <div class="goalbox">
                    <p>
                      বিয়েতে আধুনিকতার নামে কুসংস্কার, অপচয় ও অশ্লীলতা থেকে
                      মানুষদের সচেতন করা
                    </p>
                  </div>
                  <div class="goalbox">
                    <p>যৈাতুক কে নিরুৎসাহিত করে বিয়েকে সহজ করা</p>
                  </div>
                  <div class="goalbox">
                    <p>
                      নগদ মোহরানা আদায় এবং সুন্নতি পদ্ধতিতে বিয়ে সমাজে
                      প্রতিষ্ঠিত করা
                    </p>
                  </div>
                  <div class="goalbox">
                    <p>
                      কুরআন ও সুন্নাহ ভিত্তিক আদর্শ ইসলামিক পরিবার গঠন ও সমাজ
                      বিনির্মাণ করা
                    </p>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  </section>
@endsection
