<?php

return [
    'biodata_type' => [
        'male' => 'পাত্রের বায়োডাটা',
        'female'=> 'পাত্রীর বায়োডাটা',
    ],
    //married_type
    'married_type' => [
        'single' => 'অবিবাহিত',
        'married' => 'বিবাহিত',
        'divorced' => 'ডিভোর্সড',
        'widow' => 'বিধবা',
        'widower' => 'বিপত্নিক',
        //
        'unmarried' => 'অবিবাহিত',
        'interested_in_polygamy' => 'বিপত্নিক',
    ],

    //face_color
    'face_color' => [
    'fair' => 'ফর্সা',
    'very_fair' => 'উজ্জ্বল ফর্সা',
    'medium' => 'শ্যামলা',
    'olive' => 'উজ্জ্বল শ্যামলা',
    'dark' => 'কালো',
    //
    'brown' => 'শ্যামলা',
    'light_brown' => 'উজ্জ্বল শ্যামলা',
    ],

    //height
    'height' => [
    'below_4' => '৪ ফুটের কম',
    '4_1' => '৪’১”',
    '4_2' => '৪’২”',
    '4_3' => '৪’৩”',
    '4_4' => '৪’৪”',
    '4_5' => '৪’৫”',
    '4_6' => '৪’৬”',
    '4_7' => '৪’৭”',
    '4_8' => '৪’৮”',
    '4_9' => '৪’৯”',
    '4_10' => '৪’১০”',
    '4_11' => '৪’১১”',
    '5_0' => '৫”',
    '5_1' => '৫’১”',
    '5_2' => '৫’২”',
    '5_3' => '৫’৩”',
    '5_4' => '৫’৪”',
    '5_5' => '৫’৫”',
    '5_6' => '৫’৬”',
    '5_7' => '৫’৭”',
    '5_8' => '৫’৮”',
    '5_9' => '৫’৯”',
    '5_10' => '৫’১০”',
    '5_11' => '৫’১১”',
    '6_0' => '৬”',
    '6_1' => '৬’১”',
    '6_2' => '৬’২”',
    '6_3' => '৬’৩”',
    '6_4' => '৬’৪”',
    '6_5' => '৬’৫”',
    '6_6' => '৬’৬”',
    '6_7' => '৬’৭”',
    '6_8' => '৬’৮”',
    '6_9' => '৬’৯”',
    '6_10' => '৬’১০”',
    '6_11' => '৬’১১”',
    '7_0' => '৭”',
    'above_7' => '৭ ফুটের বেশি',
    ],

    //weight
    'weight' => [
    'below_30' => '৩০ কেজির কম',
    '30' => '৩০ কেজি',
    '31' => '৩১ কেজি',
    '32' => '৩২ কেজি',
    '33' => '৩৩ কেজি',
    '34' => '৩৪ কেজি',
    '35' => '৩৫ কেজি',
    '36' => '৩৬ কেজি',
    '37' => '৩৭ কেজি',
    '38' => '৩৮ কেজি',
    '39' => '৩৯ কেজি',
    '40' => '৪০ কেজি',
    '41' => '৪১ কেজি',
    '42' => '৪২ কেজি',
    '43' => '৪৩ কেজি',
    '44' => '৪৪ কেজি',
    '45' => '৪৫ কেজি',
    '46' => '৪৬ কেজি',
    '47' => '৪৭ কেজি',
    '48' => '৪৮ কেজি',
    '49' => '৪৯ কেজি',
    '50' => '৫০ কেজি',
    '51' => '৫১ কেজি',
    '52' => '৫২ কেজি',
    '53' => '৫৩ কেজি',
    '54' => '৫৪ কেজি',
    '55' => '৫৫ কেজি',
    '56' => '৫৬ কেজি',
    '57' => '৫৭ কেজি',
    '58' => '৫৮ কেজি',
    '59' => '৫৯ কেজি',
    '60' => '৬০ কেজি',
    '61' => '৬১ কেজি',
    '62' => '৬২ কেজি',
    '63' => '৬৩ কেজি',
    '64' => '৬৪ কেজি',
    '65' => '৬৫ কেজি',
    '66' => '৬৬ কেজি',
    '67' => '৬৭ কেজি',
    '68' => '৬৮ কেজি',
    '69' => '৬৯ কেজি',
    '70' => '৭০ কেজি',
    '71' => '৭১ কেজি',
    '72' => '৭২ কেজি',
    '73' => '৭৩ কেজি',
    '74' => '৭৪ কেজি',
    '75' => '৭৫ কেজি',
    '76' => '৭৬ কেজি',
    '77' => '৭৭ কেজি',
    '78' => '৭৮ কেজি',
    '79' => '৭৯ কেজি',
    '80' => '৮০ কেজি',
    '81' => '৮১ কেজি',
    '82' => '৮২ কেজি',
    '83' => '৮৩ কেজি',
    '84' => '৮৪ কেজি',
    '85' => '৮৫ কেজি',
    '86' => '৮৬ কেজি',
    '87' => '৮৭ কেজি',
    '88' => '৮৮ কেজি',
    '89' => '৮৯ কেজি',
    '90' => '৯০ কেজি',
    '91' => '৯১ কেজি',
    '92' => '৯২ কেজি',
    '93' => '৯৩ কেজি',
    '94' => '৯৪ কেজি',
    '95' => '৯৫ কেজি',
    '96' => '৯৬ কেজি',
    '97' => '৯৭ কেজি',
    '98' => '৯৮ কেজি',
    '99' => '৯৯ কেজি',
    '100' => '১০০ কেজি',
    'above_100' => '১০০ কেজির বেশি',
    ],

    //body_shape
    'body_shape' => [
    'slim' => 'চিকন',
    'average' => 'স্বাভাবিক',
    'fat' => 'মোটা',
    //
    'thin' => 'চিকন',
    ],

    //blood_group
    'blood_group' => [
    'A+' => 'A+',
    'A-' => 'A-',
    'B+' => 'B+',
    'B-' => 'B-',
    'O+' => 'O+',
    'O-' => 'O-',
    'AB+' => 'AB+',
    'AB-' => 'AB-',
    'unknown' => 'জানা নেই',
    ],

    //Education
    'education_type' => [
    'general' => 'জেনারেল',
    'qawmi' => 'ক্বওমী',
    ],

    //
    'highest_education' => [
        'below_ssc' => 'এসএসসি’র নিচে',
        'ssc' => 'এসএসসি',
        'hsc' => 'এইচএসসি',
        'diploma_ongoing' => 'ডিপ্লোমা চলমান',
        'diploma' => 'ডিপ্লোমা',
        'honours_ongoing' => 'অনার্স চলমান',
        'honours' => 'অনার্স',
        'masters' => 'মাস্টার্স',
        //
        'prathomik_deeni_shikkha' => 'প্রাথমিক দ্বীনি শিক্ষা',
        'ibtidaiyah' => 'ইবতিদাইয়্যাহ',
        'mutawasita' => 'মুতাওয়াসসিতাহ',
        'sanabia_uluiya' => 'সানাবিয়া উলইয়া',
        'fazilat' => 'ফযীলত',
        'taqmeel' => 'তাকমীল',
        'takhassus' => 'তাখাসসুস',
    ],
    //

      'under_ssc_class' => [
        'class_10' => 'দশম',
        'class_9' => 'নবম',
        'class_8' => 'অষ্টম',
        'class_7' => 'সপ্তম',
        'class_6' => 'ষষ্ঠ',
        'class_5' => 'পঞ্চম',
        'class_4' => 'চতুর্থ',
        'class_3' => 'তৃতীয়',
        'class_2' => 'দ্বিতীয়',
        'class_1' => 'প্রথম',
    ],
    //
     'education_category' => [
        'science' => 'বিজ্ঞান',
        'humanities' => 'মানবিক',
        'business' => 'ব্যবসা',
        'vocational' => 'ভোকেশনাল',

        'hsc_education' => 'এইচএসসি',
        'diploma_education' => 'ডিপ্লোমা',
    ],
    //
    'qawmi_result' => [
        'mumtaz' => 'মুমতায',
        'jayyid_jiddan' => 'জায়্যিদ জিদ্দান',
        'jayyid' => 'জায়্যিদ',
        'maqbul' => 'মাকবুল',
    ],
    //
     'religious_qualifi' => [
        'hafez' => 'হাফেজ',
        'Mawlana' => 'মাওলানা',
        'mufti' => 'মুফতি',
        'muufassir' => 'মুফাসিসর',
    ],
    //Education End

    //Familyinfo
    'family_type' => [
        'single_family' => 'একক পরিবার',
        'joint_family' => 'যৌথ পরিবার',
    ],
    //
     'father_current_condition' => [
        'alive' => 'জীবিত',
        'dead' => 'মৃত',
    ],
    //
     'brother_count' => [
        '1' => '১ জন',
        '2' => '২ জন',
        '3' => '৩ জন',
        '4' => '৪ জন',
        '5' => '৫ জন',
        '6' => '৬ জন',
        '7' => '৭ জন',
        '8' => '৮ জন',
        '9' => '৯ জন',
        '10' => '১০ জন',
        'none' => 'ভাই নেই',
    ],
     'sister_count' => [
        '1' => '১ জন',
        '2' => '২ জন',
        '3' => '৩ জন',
        '4' => '৪ জন',
        '5' => '৫ জন',
        '6' => '৬ জন',
        '7' => '৭ জন',
        '8' => '৮ জন',
        '9' => '৯ জন',
        '10' => '১০ জন',
        'none' => 'বোন নেই',
    ],
    //
     'family_financial_info' => [
        'upper_class' => 'উচ্চবিত্ত',
        'upper_middle_class' => 'উচ্চ মধ্যবিত্ত',
        'middle_class' => 'মধ্যবিত্ত',
        'lower_middle_class' => 'নিম্ন মধ্যবিত্ত',
        'lower_class' => 'নিম্নবিত্ত',
    ],
    //Familyinfo End

    ///Personal Info
    'any_creed_sect' => [
        'salafi_ahlul' => 'সালাফি/আহলুল হাদিস',
        'hanafi' => 'হানাফি',
        'maleki' => 'মালেকি',
        'shafyi' => 'শাফিঈ',
        'hamboli' => 'হাম্বলি',
    ],
    //
     'options_apply_you' => [
        'orphan' => 'এতিম',
        'disabled' => 'প্রতিবন্ধী',
        'newmuslim' => 'নওমুসলিম',
        'tie' => 'বন্ধা',
        'interested_month' => 'মাসনায় আগ্রহী',
    ],
    ///Personal Info end

    //profession info
    'profession' => [
        'imam' => 'ইমাম',
        'businessman' => 'ব্যবসায়ী',
        'teacher' => 'শিক্ষক',
        'madrasa_teacher' => 'মাদরাসা শিক্ষক',
        'entrepreneur' => 'উদ্যোক্তা',
        'freelancer' => 'ফ্রিল্যান্সার',
        'doctor' => 'ডাক্তার',
        'engineer' => 'ইঞ্জিনিয়ার',
        'govt_job' => 'সরকারী চাকুরি',
        'private_job' => 'বেসরকারী চাকুরি',
        'writer' => 'লেখক',
        'journalist' => 'সাংবাদিক',
        'accountant' => 'হিসাবরক্ষক',
        'student' => 'শিক্ষার্থী',
        'expatriate' => 'প্রবাসী',
        'farmer' => 'কৃষক',
        'housewife' => 'গৃহিনী',
        'other' => 'অন্যান্য',
        'unemployed' => 'পেশা নেই',
    ],
    // profession info End

    // marrige info
    'whate' => [
        'yes' => 'হ্যা',
        'no' => 'না',
    ],
    //
    'compromise_options' => [
        'except_deen' => 'দ্বীনদারীতা ব্যতীত সব বিষয়েই ছাড় দিতে রাজি',
        'financial' => 'আর্থিক অবস্থা',
        'complexion' => 'গাত্রবর্ণ',
        'family' => 'বংশ',
        'address' => 'ঠিকানা',
        'financial_complexion' => 'আর্থিক অবস্থা ও গাত্রবর্ণ',
        'complexion_address' => 'গাত্রবর্ণ ও ঠিকানা',
        'family_complexion' => 'বংশ ও গাত্রবর্ণ',
        'financial_address' => 'আর্থিক অবস্থা ও ঠিকানা',
        'family_financial' => 'বংশ ও আর্থিক অবস্থা',
        'no_compromise' => 'ছাড় দিতে রাজি নয়',
    ],

    // marrige info end

];// End

//date
use Carbon\Carbon;

function formatDateToBangla($date)
{
    $en = ['0','1','2','3','4','5','6','7','8','9'];
    $bn = ['০','১','২','৩','৪','৫','৬','৭','৮','৯'];

    // 
    $formatted = Carbon::parse($date)->format('d-m-Y');
    $formattedBanglaDate = str_replace($en, $bn, $formatted);

    // 
    $age = Carbon::parse($date)->age; 
    $ageBangla = str_replace($en, $bn, $age);

    return [
        'date' => $formattedBanglaDate,
        'age' => $ageBangla . ' বছর'
    ];
}

//date end


